In [1]:
import pandas

In [2]:
data = [ [1,'IT',70000,6], [2,'HR',45000,4], [3,'IT',None,8], [4,'Finance',55000,3],
[5,'HR',38000,6] ]

df = pandas.DataFrame(data, columns=['emp_id', 'department', 'Salary', 'experience_years'])
df

   emp_id department   Salary  experience_years
0       1         IT  70000.0                 6
1       2         HR  45000.0                 4
2       3         IT      NaN                 8
3       4    Finance  55000.0                 3
4       5         HR  38000.0                 6

In [ ]:
# Which department has the highest average salary?
df_1 = df.groupby('department')['Salary'].max()
df_1

department
Finance    55000.0
HR         45000.0
IT         70000.0
Name: Salary, dtype: float64

In [5]:
# Which employees earn more than the department average?
df['avg_salary'] = df.groupby('department')['Salary'].transform('mean')
df[df['Salary'] > df['avg_salary']]

   emp_id department   Salary  experience_years  avg_salary
1       2         HR  45000.0                 4     41500.0

In [7]:
#  Count employees with more than 5 years of experience per department.
df['experience_category'] = df['experience_years'].apply(lambda x: 'Experienced' if x > 5 else 'Not Experienced')
df.groupby(['department', 'experience_category']).size()

department  experience_category
Finance     Not Experienced        1
HR          Experienced            1
            Not Experienced        1
IT          Experienced            2
dtype: int64

In [8]:
#  Which departments have minimum salary below 40,000?
df_2 = df.groupby('department')['Salary'].min()
df_2[df_2 < 40000]

department
HR    38000.0
Name: Salary, dtype: float64

In [10]:
#  Fill missing salary values using department median salary.
df['Salary'] = df.groupby('department')['Salary'].transform(lambda x: x.fillna(x.median()))
df

,emp_id,department,Salary,experience_years,avg_salary,experience_category
0,1,IT,70000.0,6,70000.0,Experienced
1,2,HR,45000.0,4,41500.0,Not Experienced
2,3,IT,70000.0,8,70000.0,Experienced
3,4,Finance,55000.0,3,55000.0,Not Experienced
4,5,HR,38000.0,6,41500.0,Experienced

In [12]:
data1 =  [ [101,1,2500,'2024-01-01'], [102,2,1800,'2024-01-02'],
[103,1,None,'2024-01-02'], [104,3,3200,'2024-01-06'], [105,2,2100,'2024-01-07'] ]

df1 = pandas.DataFrame(data1, columns=['order_id', 'customer_id', 'order_amount', 'order_date'])
df1['order_date'] = pandas.to_datetime(df1['order_date'])
df1

   order_id  customer_id  order_amount order_date
0       101            1        2500.0 2024-01-01
1       102            2        1800.0 2024-01-02
2       103            1           NaN 2024-01-02
3       104            3        3200.0 2024-01-06
4       105            2        2100.0 2024-01-07

In [13]:
# Which day had the highest total order value?
df1['order_date_only'] = df1['order_date'].dt.date
daily_totals = df1.groupby('order_date_only')['order_amount'].sum()
highest_day = daily_totals.idxmax()
highest_day

datetime.date(2024, 1, 6)

In [16]:
# Which customers placed more than 2 orders?
customer_order_counts = df1.groupby('customer_id').size()
customers_with_more_than_2_orders = customer_order_counts[customer_order_counts > 2]
customers_with_more_than_2_orders.index.tolist()

[]

In [18]:
# What is the monthly total revenue?
df1['order_month'] = df1['order_date'].dt.to_period('M')
monthly_revenue = df1.groupby('order_month')['order_amount'].sum()
monthly_revenue

order_month
2024-01    9600.0
Freq: M, Name: order_amount, dtype: float64

In [19]:
# Fill missing order amounts using daily average.
df1['order_amount'] = df1.groupby('order_date_only')['order_amount'].transform(lambda x: x.fillna(x.mean()))
df1

   order_id  customer_id  order_amount order_date order_date_only order_month
0       101            1        2500.0 2024-01-01      2024-01-01     2024-01
1       102            2        1800.0 2024-01-02      2024-01-02     2024-01
2       103            1        1800.0 2024-01-02      2024-01-02     2024-01
3       104            3        3200.0 2024-01-06      2024-01-06     2024-01
4       105            2        2100.0 2024-01-07      2024-01-07     2024-01

In [20]:
# Which orders were placed on weekends?
df1['day_of_week'] = df1['order_date'].dt.day_name()
weekend_orders = df1[df1['day_of_week'].isin(['Saturday', 'Sunday'])]
weekend_orders[['order_id', 'order_date', 'day_of_week']]

   order_id order_date day_of_week
3       104 2024-01-06    Saturday
4       105 2024-01-07      Sunday

In [21]:
data3 = [ [1,'/home',120,200], [2,'/login',300,500], [1,'/home',None,200],
[3,'/dashboard',250,200], [3,'/dashboard',250,200] ]
df3 = pandas.DataFrame(data3, columns = ['user_id', 'pages', 'response_time', 'status_code'])
df3

   user_id       pages  response_time  status_code
0        1       /home          120.0          200
1        2      /login          300.0          500
2        1       /home            NaN          200
3        3  /dashboard          250.0          200
4        3  /dashboard          250.0          200

In [22]:
# What is the average response time per page?
average_response_time_per_page = df3.groupby('pages')['response_time'].mean()
average_response_time_per_page

pages
/dashboard    250.0
/home         120.0
/login        300.0
Name: response_time, dtype: float64

In [24]:
# How many failed requests exist (status_code != 200)?
failed_requests = df3[df3['status_code'] != 200]
failed_requests

   user_id   pages  response_time  status_code
1        2  /login          300.0          500

In [ ]:
# Which pages have response time above overall average?
avg_response= df3['response_time'].mean()
avg_response
pages_above_avg = df3[df3['response_time'] > avg_response]['pages'].unique()
pages_above_avg

<StringArray>
['/login', '/dashboard']
Length: 2, dtype: str

In [ ]:
# Remove duplicate log entries.
duplicates = df3.drop_duplicates()
duplicates

   user_id       pages  response_time  status_code
0        1       /home          120.0          200
1        2      /login          300.0          500
2        1       /home            NaN          200
3        3  /dashboard          250.0          200

In [29]:
# Fill missing response times using median.
df3['response_time'] = df3.groupby('pages')['response_time'].transform(lambda x: x.fillna(x.median()))
df3

   user_id       pages  response_time  status_code
0        1       /home          120.0          200
1        2      /login          300.0          500
2        1       /home          120.0          200
3        3  /dashboard          250.0          200
4        3  /dashboard          250.0          200

In [30]:
data4 = [ [1,'Math',78], [1,'Science',None], [2,'Math',35], [2,'Science',55],
[3,'Math',90] ] 
df4 = pandas.DataFrame(data4, columns = ['student_id','subject','marks'])
df4

   student_id  subject  marks
0           1     Math   78.0
1           1  Science    NaN
2           2     Math   35.0
3           2  Science   55.0
4           3     Math   90.0

In [34]:
#  What is the average marks per subject?
avg_marks = df4.groupby('subject')['marks'].mean()
avg_marks

subject
Math       67.666667
Science    55.000000
Name: marks, dtype: float64

In [39]:
# Which students scored below 40 in any subject?
students_below_40 = df4[df4['marks'] < 40][['student_id', 'subject', 'marks']].drop_duplicates()
students_below_40

   student_id subject  marks
2           2    Math   35.0

In [40]:
# Count number of subjects per student.
subjects_per_student = df4.groupby('student_id')['subject'].count()
subjects_per_student

student_id
1    2
2    2
3    1
Name: subject, dtype: int64

In [41]:
# Fill missing marks using subject average.
avg_marks = df4.groupby('subject')['marks'].transform(lambda x: x.fillna(x.mean()))
df4['marks'] = avg_marks
df4

   student_id  subject  marks
0           1     Math   78.0
1           1  Science   55.0
2           2     Math   35.0
3           2  Science   55.0
4           3     Math   90.0

In [47]:
# Which subject has the highest variance in marks?
variance = df4.groupby('subject')['marks'].var()
variance

subject
Math       836.333333
Science      0.000000
Name: marks, dtype: float64

In [48]:
data5 = [ [101,'Electronics',50,15000], [102,'Electronics',None,12000],
[103,'Furniture',30,8000], [104,'Furniture',70,9000], [104,'Furniture',70,9000] ]
df5 = pandas.DataFrame(data5, columns = ['product_id', 'category', 'stock', 'price'])
df5

   product_id     category  stock  price
0         101  Electronics   50.0  15000
1         102  Electronics    NaN  12000
2         103    Furniture   30.0   8000
3         104    Furniture   70.0   9000
4         104    Furniture   70.0   9000

In [50]:
# Which categories have total stock below 100?
category = df5.groupby('category')['stock'].sum()
category[category < 100]

category
Electronics    50.0
Name: stock, dtype: float64

In [52]:
# Which products are priced above category average price?
avg_price = df5.groupby('category')['price'].transform('mean')
above_avg = df5[df5['price'] > avg_price]
above_avg

   product_id     category  stock  price
0         101  Electronics   50.0  15000
3         104    Furniture   70.0   9000
4         104    Furniture   70.0   9000

In [ ]:
# Fill missing stock values using category median.
category_median = df5.groupby('category')['price'].transform('median')
df5['stock'] = category_median
df5

   product_id     category    stock  price
0         101  Electronics  13500.0  15000
1         102  Electronics  13500.0  12000
2         103    Furniture   9000.0   8000
3         104    Furniture   9000.0   9000
4         104    Furniture   9000.0   9000

In [59]:
# Identify duplicate product records.
duplicate_products = df5[df5.duplicated(subset=['category'], keep=False)]
duplicate_products

   product_id     category    stock  price
0         101  Electronics  13500.0  15000
1         102  Electronics  13500.0  12000
2         103    Furniture   9000.0   8000
3         104    Furniture   9000.0   9000
4         104    Furniture   9000.0   9000

In [60]:
# What is the total inventory value per category?
df5['inventory_value'] = df5['price'] * df5['stock']
total = df5.groupby('category')['inventory_value'].sum()
total

category
Electronics    364500000.0
Furniture      234000000.0
Name: inventory_value, dtype: float64